[
    {
        "name": " Electra Metropolis",
        "score": "9.1",
        "location": "Mitropoleos 15, Athens, 10557, Greece",
        "latlng": "37.97521320,23.73213800",
        "popular_facilities": [
            "2 swimming pools",
            "Free WiFi",
            "Airport shuttle",
            "Family rooms",
            "Spa",
            "Tea/Coffee Maker in All Rooms",
            "Bar"
        ],
        "images": [
            "https://cf.bstatic.com/images/hotel/max1024x768/155/155083203.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250952586.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/114/114470859.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250952096.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250952119.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951877.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951607.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951254.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951257.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951259.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951265.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951275.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951290.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951297.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951072.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250951075.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187291235.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250950720.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250950722.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/114/114471189.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250950021.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/250/250950027.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187294732.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187294098.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187294378.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187295244.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187296034.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187295182.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187295045.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187294961.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187294947.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187294048.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187294247.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187293968.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187293409.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187293195.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187292337.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/187/187291247.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/140/140254868.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/140/140255857.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/119/119526203.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/140/140255338.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/140/140255780.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/140/140255371.jpg",
            "https://cf.bstatic.com/images/hotel/max1024x768/140/140255748.jpg",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/194564.webp?k=f3e2d777a8651778a9084b1751528897af2016b1ee547665c7fb4b9085a598a0&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/178982.webp?k=d274545d487ee5a66a78c7c8bde2c0513127e8af7899dd34ff958b0be66ee7f4&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/245028.webp?k=24062dd7b2b12d3b3a022ecffafbda03d71b0705da23d1f7b1cb498e2da166b8&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/242820.webp?k=cf4abb0d300e48e1f69f7b248d6998315b60ed2da0437579f12e995fdec09e7a&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/169144.webp?k=9df1476491592138e8ffb171bdfd66e0320b57ed992715b7ee8a31297364a1be&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/228510.webp?k=d222363ac9d1dca8aec67a56ba1eee14e851c6210d43548694d664c75aef2b3f&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/175088.webp?k=5e3e02e4e2ba1551b47a5ed2b547e0c6dee197a12b554f32d7008b3332baf6dc&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/186315.webp?k=4ddfdcda8fa66d8a7b250a9d6d9cf7781762e6ccf500a40bf2c8f701152d0404&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/189877.webp?k=f4768418e62b129cc81084cd6b53630c7b502fedb7c0f65a007e6c2ec11e600a&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/224432.webp?k=79b7664109e4f8c6c8ea6a65e6008c6583025749a4f3f95426b37155e30721e0&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/231366.webp?k=3fcedc0cf3417be4d79b7fef2123b6ae472e796b20e6b85a44d85134872c1551&o=",
            "https://cf.bstatic.com/xdata/images/landmark/max1024/215737.webp?k=b40c50201ed51076f25b0020347e9fd55d4bae66f137e551bce883669cc0bb46&o="
        ],
        "reviews": [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "“Great location, wonderful facilities , we really enjoy our time .”",
            "“It is in the best location to walk in central\nAthens. Great facilities, spectacular view from the restaurant/bar on roof top. Rooms were sanitized, towels packed in nylon, super clean and hotel staff was very careful in this difficult period with CO…",
            "“Great location, excellent staff, very good breakfast and exent view from the Acropolis suite.”",
            "“Fantastic breakfast , congratulation for your Batman he do fantastic cocktails drinks . Restaurant in floor except the best vue in Athens has excellent menusacce”",
            "“Check-in & Check-out efficient, warm and professional. Room available before 14:00.\nRooms spacious, modern as expected. Bathroom spacious and luxurious with all amenities and toiletries.\nBed comfortable, big with a very good mattress and pillows. We…",
            "“Perfect location, close to everything. Big rooms with everything you would expect from a hotel. The rooftop is fabulous and a perfect way to relax with views of the Acropolis and a dip in the pool. Breakfast was very nice.”",
            "“Excellent location, modern \"urban\" feel to the hotel, amazing view and food on the roof bar/restaurant, friendly helpful staff”",
            "“923/924 acropolis suite the best place to stay. Everything was above expectations!”",
            "",
            "“Perfect view, very clean and large rooms, very kind and welcoming staff, excellent cuisine in the restaurant.”",
            "",
            "“The rooms were very clean very carefully and well equipped. view from the bar and pool was excellent ”",
            "Super quite though it is super central. Stunning Acropolis view",
            "Great location",
            "N/A",
            "The hotel is great! Location is perfect and view from rooftop is AMAZING",
            "All was good",
            "The staff were kind and super nice. Very helpful with our baby’s needs.",
            "Breakfast was a good selection of food well prepared. \nAll meals are served on the 10th floor rooftop with a panoramic view of Athens & Acropolis-magical",
            "A few small snacks in the room which you might think are complimentary are not and chargeable. There is no sign to explain this and prices are very high- beware or complain as we did and they refunded us the charge",
            "This hotel is probably one of the best located hotels in Athens. The view on the acropolis from the rooftop restaurant is stunning! Shopping around the hotel is very pleasant and the acropolis and old center is within short walking distance from the hotel. Breakfast is delicious! Very good efforts to fight COVID. Recommended.",
            "NA",
            "The staff was nice and helpful and the location is very good- from each place around the city you can easily come back.",
            "We came around 11pm and we got a room that was nice but when you opened the window- all you could see was another building and the people in it. \nI was very disappointed since all of the pics here showed the acropolis from the window...\nWhen we asked to move to a different room the receptionist said that the hotel is full and we couldn’t get a different room. \nAlso, we mentioned before our arrival and during our time at the hotel that we’re celebrating our engagement and my birthday and unfortunately we didn’t get any acknowledgement from the hotel... not even some chocolate or fruits. They only gave us a normal size bed and not two small beds pushed together.",
            "Amazing location, great view of the Acropolis from the roof with a lovely bar. We didn’t try the restaurant but it has very good reviews. Rooms are big, comfy and clean. And the staff were fantastic. We were on our honeymoon and they couldn’t have been nicer.",
            "The understandable Covid restrictions mean there was rather a queue at breakfast time as you could serve yourself. Maybe they could do timed sittings so it wasn’t crowded.",
            "The Electra Metropolis is a nice 5 star hotel in the center of Athens. The rooms are stylish and nice. The highlight is the restaurant and pool on the top floor. I had a nice stay at the Electra Metropolis",
            "Everything was perfect. The room simple but big enough to accomodate 2 people, there was no view from the 3rd floor but hotel is located in the middle of Athens city so all around there are only buildings. I think the view gets better from the 7th floor to 10th (the rooms are more expensive at that level) . On the 10th floor the view is amazing. You look towards to acropolis, the pool is nice (but tiny for a hotel like this, meaning that there is not enough space for more than 10 people. So you pay for the pool but Noone knows if you'll be able to enjoy it!!!) the menu is rather expensive.. You pay more for the acropolis view but the food quality is not value for money. The menu It's overpriced.. So mind you before you order.. The room bathroom is very nice! There are amenities! Mini bar ok, bed very comfortable. Breakfast : lot's of things to try, very good quality! Service : employees extremely polite!! In general i was satisfied but next time i have to look for a less crowded place to stay! Refards",
            "Tiny roof pool. During the weekends unless you get there very early (9:00 in the morning) you'll never enjoy the pool. It's the most noisy pool I've ever tried to enjoy.. Apart from that everything else is okay 👌.",
            "The hotel is conveniently located near the Plaka area. The room was comfortable and the free drink in the bar was appreciated.",
            "Breakfast not included (25€ per person!) in the price of the room and no parking either. One of the swimming pools was closed because of COVID 19 and the one on the terrace was not heated.",
            "The Location was ideal for someone that is interested in exploring the cultural highlights of Athens. The bed was very comfortable. Everything was clean and well kept.",
            "The facilities of the rooms were quite cold and boring. To us, it felt like a business hotel - very rational and uninspiring.",
            "Location, easy to walk to main sights, shops and restaurants Book an Acropolis view room",
            "Pool area too small for number of guests who then ‘hogged’ the sun beds all day Charged for a 1lL bottle of water with dinner without being asked Breakfast queues are mad as nobody uses the QR code booking and it is not enforced",
            "great hotel for travelers to Athens: very clean, great staff and great location meets fair price",
            "Staff very nice and helpful. Rich breakfast. Superb location",
            "Convenient and confortable",
            "Snack food at the rooftop",
            "The staff were extremely nice, the facilities were at a great condition and the hotel is in an excellent location",
            "Very comfortable and tasty hotel. We loved the pool and the terrace.",
            "It‘s not allowed to smoke at the balcony. We payed fifteen euros for a coffee and a lemonade at the rooftopbar...",
            "Everything",
            "Nothing",
            "The location was amazing and the view is really something",
            "The area in the sun by the pool isn’t huge and lots of people “reserve” beds, leaving them empty for hours... there should be a policy against that as the pool area isn’t huge",
            "Exceptional location and stunning views of Acropolis",
            "Our room was quite small and had a terrible view",
            "Great view on the Acropole",
            "Location is perfect with amazing view of the Acropolis.",
            "Breakfast procedures (due to COVID I guess) aren’t great. Long queue.",
            "A perfect view from both the restaurant and the pool! The perfect place to watch the sunset! Spacious, clean room. Modern hotels. Delicious breakfast.",
            "Dinner (for an extra charge) - expensive / mediocre. Drinks are also expensive. However, because of the view, it is worth paying for!",
            "Clean, modern room Great restaurant Nice staff",
            "Nothing",
            "Location, facilities, roof top pool/bar",
            "Prices, food ok but overpriced compared to what quality. Very unattentive staff in the restaurant, always had to go to the bar and order to Ask for bill, orders etc. Not that service minded as you would wish for a 5 star restaurant.",
            "Location is great. Amazing view from the restaurant to the acropolis. Staff was so nice",
            "Great rooms with wonderful location to all Athens sites. One of the best rooftop views in Athens",
            "Pool, food, views, cocktails.",
            "Very dirty rug by bed.",
            "Electra is my favourite Hotel in Athens! It feels always like home! Staff is awesome!",
            "Pool and Spa",
            "Lovely spot well placed for museums. Nice roof restaurant and pool!",
            "The hotel is conveniently placed for the Plaka district of Athens. The view from the terrace is stunning both at breakfast or whilst enjoying a cocktail in the evening. The buffet breakfast was well managed during the current covid restrictions, the staff just asked what you would like and they picked the items for you. Nothing was a problem and quite honestly nothing felt different which was lovely. The hotel gym was open, However you had to book a slot which was easy and no problem at all. The hotel has a small rooftop pool with limited seating area, understandable due to it being a city hotel.Despite its city centre location the terrace was very relaxing and quiet. Due to covid it was essential that the area was not overrun with guests. In general the area was quiet but on the weekends particularly around 2.00 PM the terrace  around the pool became busy and there was a queue for loungers. Sadly many guests did not react well to this and on most days (we stayed 6) staff were verbally abused by guests demanding loungers were moved to accommodate more people.Very upsetting to see, as the staff were only adhering to government guidelines and were working incredibly hard. The rooms were spotless and a really nice size with pleasant furnishings. It was lovely to have the option of a bath and shower.Despite its location it is very quiet. The biggest draw to the hotel were its staff, from the moment we arrived until we left the service we had was incredibly friendly and efficient  and was certainly five star. The staff are an asset to the hotel particularly during this confusing time. Would return for the service alone.",
            "Many guest being rude to the very busy and polite staff.",
            "Everything",
            "All perfect, second time here",
            "Great rooftop terrace! Comfortable room.",
            "Everything was great....",
            "Everything clean. Good size for a room. Strict COVID regulations",
            "Could have a bigger breakfast Choice",
            "Beautiful hotel in an excellent location. Lovely pool and bar on the roof with stunning views of the Acropolis. Our room was spacious and tastefully decorated and breakfast was very good. Location is great for seeing the key sites in Athens and the hotel is in a trendy area with lots of quirky bars and cafes nearby. The staff were excellent and attentive, especially everyone on the front desk. I highly recommend this hotel and look forward to going back!",
            "Nothing.",
            "Very nice and clean hotel with large rooms and a fantastic rooftop with a nice pool and a great view. The hotel is very well located.",
            "We booked a room for three people, so one had to sleep on a bed sofa which was not very comfortable.",
            "Comfortable, clean met covid requirements well. Breakfast delicious, service good. Spa open for treatments, very good. Location fantastic close to Plaka and Acropolis plus shops.",
            "Pity could not enjoy Spa facilities due to Covid19.",
            "Location was excellent",
            "Deluxe city room was small on 5th floor",
            "Great hotel, very central, great transfer service available to pick you up from the airport. The pool, although small, is very comfortable, the music great (quiet, chill yet not boring nor blaring), the room and its view were both great and all the staff was really helpful and welcoming. And you're extremely close to everything, all the major attractions in Athens.",
            "The swimming pool is a bit small, but they allowed us to use the terrace as a sunbathing spot when there were no chairs available. The breakfast buffet could be more varied and have different things, but there was plenty of fresh and juicy fruit, for example, so that's ok.",
            "Only stayed one night but the location was excellent with great views of the Acropolis. Lovely staff, rooms and breakfast. We also received a complimentary drink at the rooftop bar. Perhaps a little pricier than other places but you are getting the incredible view and a high quality hotel. Would definitely stay here again when passing through Athens.",
            "The beds were a little on the soft side but not really a problem for a one night stay.",
            "Friendly service",
            "location and breakfast were excellent",
            "The view from the top suite was amazing with a really nice balcony.",
            "Nothing",
            "Great service, perfect location and amazing view. Great pandemic safety standards!",
            "Excellent breakfast where the staff serve your food from a buffet with social distancing and Protective masks and gloves. Location is near cafes, shops and restaurant. The receptionist recommend the old tavern psaras and the food was really great and the location was fabulous. We went to the Acropolis and the Acropolis museum- I highly recommend. The combined extra ticket for €30 does not get you into the museum so it’s probably only worth getting the €20 one unless you actually want to go to any of the 7 attractions that are included.",
            "Pool was a little small and busy at all times of the day although you can still sit at the tables if a sun lounger is not available.",
            "This is not a 5 star hotel in the international standard. No complimentary water only certain categories apparently. The bed very hard and sheets not of the highest quality. Staff were friendly and the view from the Rooftop is excellent and is a 5 star view. I am of the opinion that no hotels are really 5 star si manage your expectation once you have check in.",
            "No complimentary water. Bed very hard and sheets and pillow not of great quality",
            "Very comfortable bed and spaciously clean bathroom. All the staff were welcoming, friendly and attentive. We would highly recommend this hotel to anyone visiting Athens, not just for the great view at breakfast but also for its central location.",
            "This hotel is in an ideal position to see the city in a short space of time. The room was a good size and the amenities were good also. Some of the staff were super friendly (and funny too!). The views from the restaurant were also sensational.",
            "The pool is small and seemed packed most of the day. The view from our window was not that great also.",
            "Comfortable room and bed. Great location. Good breakfast. Wonderful views both from the room and rooftop bar. Pool, although small, was very pleasant after a hot day walking.",
            "Excellent location, great service, I was upgraded to a better room for free without even asking.",
            "We had an amazing time, the entire staff was really helpful and did everything to make our honeymoon perfect, with complimentary champagne and cake. The pool is great, the breakfast is delicious and the view is breathtaking, we will come back for sure!",
            "+ roof top pool + roof top terrace with view on acropolis + delicious food in restaurant and good breakfast + modern and clean rooms + friendly, warm and welcoming atmosphere + would come again",
            "- pricy drinks at pool bar - small gym",
            "Our stay was great! The view at the top was mesmerizing.",
            "Nothing. Everything was fine. Central location, nice interior, polite staff.",
            "Location , modern and comfortable stay with an amazing rooftop view of Athens. The staff’s hospitality was superb especially the team at the rooftop bar and restaurant.",
            "If I had to cherry pick , I would say be more vigilant with the new measures put in place . E.g. all toiletries should be replaced after each guest . I found that some of the bottles of shower gel from the previous guest weren’t replaced. Also ensure that guests are aware they need to be one person or one visiting party at a time in elevators . There is a small sign , but I’ve seen a few guests ignore social distancing. Finally a complimentary bottle of water should be in the room and replaced everyday. It would also be helpful if you put a QR code next to the nuts and crisps so we are aware they are not complimentary. I only found out later after i ate them that they are part of the mini bar list, which is a QR stuck on the fridge hidden in the cupboard. Complimentary coffee and tea would’ve been nice too but I didn’t find any in the room - just a kettle with cups ? Honestly I just wanted to give a few tips here to make the experience even better. I loved my stay",
            "Location was amazing Breakfast was very good",
            "Great location, wonderful facilities , we really enjoy our time .",
            "Shower no bath",
            "Very good breakfast, ideal localization.",
            "Amazing view!",
            "Nothing",
            "Staff food location clean",
            "My first time in Athens and I love my stay so much. Easy to walk anywhere in the center",
            "Amazing view, staff lovely and very helpful and taking very good Covid precautions. “Gin Mare” is a fantastic cocktail to watch the Acropolis with!",
            "Nothing",
            "good location excellent personnel. beyond imagination",
            "Location and views of the acropolis. Very friendly and professional staff. Going the extra mile to keep the hotel sanitized and the guests safe during the COVID-19 pandemic. We felt very safe.",
            "Breakfast could be improved. We had room including breakfast but the Eggs were chargeable and overpriced.",
            "Fantastic view of the acropolis",
            "The roof terrace is one of the best in Athens. The Hotel was very clean, and staff truly kind. Maybe the dinner was a bit expensive, but the rooftop is such a lovely place.",
            "It is the perfect stay in Athen!",
            "I like the place, people, facilities and all about Electra!",
            "swimming pool is quite small",
            "Central, spacious rooms, nice staff.",
            "Breakfast was the weakest part of the experience. Still okay though.",
            "Very nice view on the Acropolis from a confortable room.",
            "Location. Ptofessional staff.",
            "Roof top pool and location",
            "Not a huge selection for breakfast, but the location more than makes up for any small complaints.",
            "The restaurant seem to think it's 2005 and you can still gey away with serving one carrot with a creative drizzle of jus and charge €30 for it because it's \"high cuisine\".",
            "It was clean and the staff respected all Corona safety rules. As a gueat I felt safe. I also loved the fact it’s in the center.",
            "Excellent location. Great views from the restaurant at breakfast.",
            "The view from the rooftop was absolutely stunning, the best location! the room itself is great, the beddings are clean and comfortable. The shower Stream is at good pressure and there are good hygiene supplies. Good noise proof room with perfectly functioning air condition. The room service is 10/10, breakfast is catered by very professional , welcoming staffs",
            "The pool close too early",
            "Roof garden view of Acropolis. Amazing.",
            "Nothing",
            "The location is very close to the old city",
            "The people was very friendly kind and helpful",
            "We stayed at the hotel for two nights, the measures put in place due to COVID-19 are outstanding, they are very diligent. The hotel was perfect and centrally located within Athens. I would recommend booking dinner in their restaurant which over looks the Acropolis and the food is superb. We’ll be back again!",
            "Really good hotel, the room was perfect with a spectacular Acropole View. Located in a very central area, the Electra Metropolis could be recommended with no problem.",
            "Breakfast in the room was not you can expect from a 5 stars. But COVID situation could be an explanation right now.",
            "It is right in the heart of the city and as long as you get the right room, you have fantastic views. The restaurant on the top floor gives you vistas of the city and the Acropolis. We were upgraded to a suite (for an extra price) and it was worth paying the difference.",
            "We went on our honeymoon but this did not register at all with the receptionist who allocated us a room with twin beds and views of a building site across the street. Only after complaining were we reluctantly given an upgrade, which we had to pay for. The restaurant has superb views but is very expensive.",
            "Had dinner in the main restaurant and on reflection it is the best meal I have ever had. Food was excellent, tasty and creative but still generous.",
            "Nothing",
            "Rooftop breakfast",
            "Great location and amazing view.",
            "The view from our room was not great.",
            "Location Rooftop bar & pool Breakfast Room style & size",
            "Cant think of anything...... 🤔",
            "Great location - spectacular rooftop view! Friendly, helpful staff",
            "The roof on the patriot by the pool leaked in many areas when it rained.",
            "Great view, excellent service, excellent COVID preparation.",
            "Room service breakfast was expensive for what you received.",
            "Staff was exceptionally friendly. The location of the hotel is great as it is in walking distance to a lot of good restaurants and bars and also to the shopping streets. It is also very close to the acropolis and the parliament. The rooms are very nice! But the best part is the stunning view from the roof terrace ! We’ll definitely be back !",
            "The restaurant area in the top floor has an exceptional view of acropolis. The hotel is well located and they have good safety measures for covid19.",
            "The staff were all helpful and friendly. The roof top restaurant did a good breakfast, and quick to serve drinks after a long day of sightseeing. We had a lovely evening meal there with a perfect view of the Acropolis just as the lights were being switched on. Even with all the restrictions due to Covid it was still a great place to stay and relax.",
            "The staff the facilities cleanliness and location/views",
            "1. Useless booking.com messaging - sent a note for an urgent matter got an automated reply 30 hours later. If you cannot answer promptly disable it. 2. Room 626 had a loose wooden beam at the base of the bathroom door. You should fix it asap. Luxury is in the details.",
            "The pool on the roof is very nice to have after a day out. The restaurant has a marvelous view of the Acropolis. Perfectly located close to the nice area of Plaka.",
            "First of all, I have had the good fortune to have travel the world, 1st class. However, on this trip, my husband of 20+ yrs and my eldest son could not come, so it was just myself (the mom) & my 11 yr old son. I tried to be more conservative than usual with spending money on ourselves. That said, the entire staff was so exceptionally understanding of our 1 mom+1 child situation that they were SO generous with their kindness, services & general hospitality. It so encouraging to see human nature NOT succumbing to the negative effects that CoVid has on the hospitality industry. 1 note that I would care to make is to remind all travelers that the hospitality industry is risking their lives every day in the hope of making a buck. Be generous. Tip heavily. Its very courageous of those who are out serving us, to do so & NOT stay home and collect benefits. Reward them for their courage and kindness. For if it were not for them, there would be no travel, whatsoever. And they afforded us the happiest memories that my son and I will cherish forever.",
            "not a thing. Everything, every person, every towel, every housekeeper was nothing short of grateful and amazing.",
            "The location within the central is pefect, easy to reach even by taxi or public transport. The hotel itself is really elegant and beautifully decorated. The classic room is comfortable, although the beds are rather small, the bathroom is exceptionell. The rooftopbar has a wonderful view over the acropolis, the dishes were also really delightful. The breakfast menu is okay also. The staff cares about the covid-19 restrictions, which is a really good point!",
            "The rooftop pool area is small comparing to the hotel’s size. There are always less sunbeds, however we were lucky each day and found ours. In my opinion a separate staff would be needed for the pool to supervise the situation and the kids jumping all day long in the pool even through it is forbidden. But it’s a minor point as all other services of the hotel were really great!",
            "The hotel is perfect - in a fabulous location, the rooftop restaurant and pool have amazing views, the service prompt and professional, and the hotel itself is immaculate.",
            "In the morning there were queues for breakfast but that was because of safety measures taken against Covid-19.",
            "Breakfast was good and plentiful, beautiful fresh fruit, and a decent selection of heartier fare - eggs, bacon, waffles, pancakes. Location is great, lots of good places to eat nearby, easy access to historical Athens and nice to be so close to national garden too. Staff were very helpful and professional.",
            "Pool opening times were strangely short, 10-7. I would have enjoyed a refreshing swim in the evening and early morning. I would see 5am-12midnight as better opening times for the pool.",
            "Central Wonderfull view from the rooftop Rooftop pool",
            "The decoration felt a little outdated.",
            "It was lovely, staff were amazing!",
            "perfect location with great views from rooftop restaurant .. staff were very helpful and good protocols in place for social distancing and food service.",
            "limited menu at rooftop restaurant for dinner... maybe more greek than international? can't use pool until after 11am in morning.",
            "Pool, view to the Acropolis and room cleanliness",
            "Staff at bar were occasionally rude",
            "Really enjoyed my stay at Electra Metropolis. The location is perfect, short walking distance to Acropolis, Syntagma Square, other sights and museums and lots of shops and restaurants. The hotel is quite new, and both rooms and common areas are in a good condition. Staff is wonderful, friendly and courteous. The hotel has implemented health safety measures ( without compromising the quality of service) , and the rooms are very clean. Rooftop restaurant with the view of Acropolis is a must. I will stay again if I am to visit Athens.",
            "Nothing I can think of",
            "The staff in this hotel are exceptionally nice. The view from the roof terrace towards the Acropolis is fabulous. The location is excellent for sightseeing and also walking to restaurants and shops.",
            "The location is brilliant opposite great restaurants and shopping, staff were welcoming Great gym and spa",
            "It is in the best location to walk in central Athens. Great facilities, spectacular view from the restaurant/bar on roof top. Rooms were sanitized, towels packed in nylon, super clean and hotel staff was very careful in this difficult period with COVID. You could feel safe without loosing all the luxury.",
            "Nothing really.",
            "Very central and clean and amazing roof top",
            "Very poor breakfast for a 5 stars hotel and in a country with amazing food The lobby could be better arranged same for the roof top. We don’t understand the way tables are set there is not harmony although the hotel has the best roof top of the city",
            "Good amenities, fantastic view of the Acropolis from the rooftop, large bathtub, very good spa.",
            "Our room was facing east and the curtains were not nearly opaque/long enough to prevent sunlight from coming in pretty early in the morning.",
            "It is a beautiful hotel in a center of ancient town - close to everything you want in Athens. We loved our room that was perfectly adjusted for a second bed for our 6-yrs old son. Plenty of furniture to accommodate our clothes! We don't know too many hotels around the world in the center of cities that have a swimming pool. Electra does and it is on the roof with the view of Acropolis! Absolutely stunning! We discovered the view from eating breakfast on the terrace overlooking Acropolis. On top of all great real estate the staff was extremely helpful. We needed to have breakfast before 6:30 am opening, they opened 10 minutes earlier to get us some food. I am definitely staying at Electra, if I come to Athens again.",
            "It was a perfect stay.",
            "Breakfast was nice and the roof top is fantastic to relax, work or chill by the pool. The beds are very comfy. Some staff members were exceptional ( the guys at the rooftop, the spa & gym ladies) and Irini the General Manager was absolutely lovely. Will definitely return.",
            "Clean, location, service, food.",
            "Nothing",
            "Awesome location, clean, friendly staff, great view on Acropolis",
            "Small gym",
            "Great restaurant, excellent view, friendly stuff.",
            "The location is perfect",
            "The new procedure due to COVID-19 disrupt the usual type of service you get. Booking of the gym is required Waiting for turns to go to bf according to the no of people Cleaning of the room on request",
            "Everything was amazing, the pool, the food and the view, the location; but most of all, the really lovely staff.",
            "Pool not open till 11am, I know people need to have their breakfast in peace, but it’s good to wake up and have a (quiet) swim.",
            "The Electra Metropolis is a 10 minute walk from Syntagma Square Metro station - the heart of Athens - and the surrounding streets teem with cafés and restaurants. The room was large and wonderfully quiet, the bed extremely comfortable and the bathroom luxurious. Pleasant, highly-professional staff.",
            "Great place and great value. Staff helpful and friendly. Breakfast was simple with excellent quality.",
            "-",
            "Great location with a fantastic view. This is a lovely hotel with great spa facilities and a really decent breakfast with lots of options. Rooms are well decorated and are really comfy - I would definitely stay again.",
            "Most of the drinks were good prices but a double Amaretto was 20 Euros!",
            "Staff were amazing during our stay, warm and welcoming, attention to detail was great, super comfortable bed in a very well appointed room. Breakfast was top notch, great selection and quality and so nice to be greeted with a warm welcome every morning. Every member of staff we met smiled and chatted with us just a lovely approach to guests! The bar is on the 10th floor with simply the best view in Athens, cocktails mixed to perfection! The hotel is situated so perfectly in the center of Athens. I will definitely return!",
            "Honestly, there was nothing I can fault, well done team Electra Metropolis.",
            "Room top bar",
            "Small gym “goldfish bowl”",
            "Reception staff is very helpful and friendly. I have been to Athens a lot because of my business trip. They help me stay in the same room according to availability. So it feels like home :).",
            "Nothing.",
            "It was clean and newer development. The ambience was great and in the perfect location that was central to everything.",
            "Great room, outstanding view of Athens and the Acropolis, friendly and helpful staff, great location. This one has it all!",
            "Nothing, it was perfect.",
            "Excellent breakfast with breathtaking view, friendly staff, very clean and spacious room, taxi always available in front of the hotel. Our flight back was late in the afternoon and they gave us the room for 4 more hours with no extra charge. Loved the hotel, definitely going back!",
            "Great location and friendly staff",
            "Hospitality and service was excellent thank",
            "Nothing to complain about everything was good",
            "Best location close to everything and walk distance to old town Plaka, Acropolis and Acropolis Museum, Agora and many more. Great breakfast also included with stunning Acropolis view. Can’t ask for more. Thank you.",
            "Location",
            "Toilets",
            "Everything about the hotel",
            "Nothing",
            "Beds were quality!!!",
            "Nothing really",
            "The staff. All being very friendly and supportive. Email response in time for all the enquiries.",
            "Suggest to book the good view suite/room. Our room for 3 people which window to one of office building. Have to close the curtain all the time, even in day time. Other than that, all good"
        ]
    }
]